In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
my_dic = {"col":[1,2,3,4], "col2":[3,4,5,6], "col3":[5,7,8,9]}
a = ["a", "b", "c", "d"]

In [4]:
df = pd.DataFrame(data=my_dic, index = a)

In [5]:
df

   col  col2  col3
a    1     3     5
b    2     4     7
c    3     5     8
d    4     6     9

In [6]:
df.loc["c"]

col     3
col2    5
col3    8
Name: c, dtype: int64

In [7]:
df.iloc[0]

col     1
col2    3
col3    5
Name: a, dtype: int64

In [8]:
dict2 = {"col1":[1,2,3,4], "col2": pd.Series([4,6], index=[2,3])}
df2 = pd.DataFrame(data=dict2, index=[0,1,2,3])

In [9]:
df2

   col1  col2
0     1   NaN
1     2   NaN
2     3   4.0
3     4   6.0

In [10]:
df

   col  col2  col3
a    1     3     5
b    2     4     7
c    3     5     8
d    4     6     9

In [11]:
df2

   col1  col2
0     1   NaN
1     2   NaN
2     3   4.0
3     4   6.0

In [12]:
b = pd.Series([2,3,4,5], index = [1,2,3,4])

In [13]:
df2.insert(0,"new_col", b)

In [14]:
df2

   new_col  col1  col2
0      NaN     1   NaN
1      2.0     2   NaN
2      3.0     3   4.0
3      4.0     4   6.0